---
type: DirectContext3DHandleOverrides
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 6
tags: [revit-api, class]
---

# DirectContext3DHandleOverrides

`Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Assign | 2018 | `public void Assign ( DirectContext3DHandleOverrides other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDirectContext3DHandleSettings | 2018 | `public DirectContext3DHandleSettings GetDirectContext3DHandleSettings ( Document aDoc , ElementId elementId )` |
| Method | IsEqual | 2018 | `public bool IsEqual ( DirectContext3DHandleOverrides other )` |
| Method | SetDirectContext3DHandleSettings | 2018 | `public void SetDirectContext3DHandleSettings ( Document aDoc , ElementId elementId , DirectContext3DHandleSettings newSettings )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |